tests/com/l7tech/service/resources/dotNetSecurityTokenRequest.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsa:Action wsu:Id="Id-9d68f252-4972-4e5e-ab46-2f90e95674cc">http://schemas.xmlsoap.org/ws/2004/04/security/trust/RST/SCT</wsa:Action><wsa:MessageID wsu:Id="Id-7b4ea330-2071-4a51-9103-e0ec527791fd">uuid:12309c59-1ca8-4b5d-ae2b-4072de0b9280</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-115a8da4-d9ee-4d26-be96-c56dbe738543"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-1db92e97-c574-4c07-834a-da516f58fe7d">http://riker:8888/tokenService</wsa:To><wsse:Security soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-2bd6edbe-6b9f-4d46-89bf-c18047dfc7d6"><wsu:Created>2004-08-05T21:57:21Z</wsu:Created><wsu:Expires>2004-08-05T22:02:21Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-91913aad-7454-4e65-a7b6-1e181b8b056d">MIIBxDCCAW6gAwIBAgIQxUSXFzWJYYtOZnmmuOMKkjANBgkqhkiG9w0BAQQFADAWMRQwEgYDVQQDEwtSb290IEFnZW5jeTAeFw0wMzA3MDgxODQ3NTlaFw0zOTEyMzEyMzU5NTlaMB8xHTAbBgNVBAMTFFdTRTJRdWlja1N0YXJ0Q2xpZW50MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC+L6aB9x928noY4+0QBsXnxkQE4quJl7c3PUPdVu7k9A02hRG481XIfWhrDY5i7OEB7KGW7qFJotLLeMec/UkKUwCgv3VvJrs2nE9xO3SSWIdNzADukYh+Cxt+FUU6tUkDeqg7dqwivOXhuOTRyOI3HqbWTbumaLdc8jufz2LhaQIDAQABo0swSTBHBgNVHQEEQDA+gBAS5AktBh0dTwCNYSHcFmRjoRgwFjEUMBIGA1UEAxMLUm9vdCBBZ2VuY3mCEAY3bACqAGSKEc+41KpcNfQwDQYJKoZIhvcNAQEEBQADQQAfIbnMPVYkNNfX1tG1F+qfLhHwJdfDUZuPyRPucWF5qkh6sSdWVBY5sT/txBnVJGziyO8DPYdu2fPMER8ajJfl</wsse:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-9d68f252-4972-4e5e-ab46-2f90e95674cc"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>gKxFc/WVpTlmZh7f6u4R09ni/1Y=</DigestValue></Reference><Reference URI="#Id-7b4ea330-2071-4a51-9103-e0ec527791fd"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>6E7Z1wG18oYUpozMrhsR2lapeLc=</DigestValue></Reference><Reference URI="#Id-115a8da4-d9ee-4d26-be96-c56dbe738543"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>76eO6i4Jk+UAru8y5vNUXzdHMkA=</DigestValue></Reference><Reference URI="#Id-1db92e97-c574-4c07-834a-da516f58fe7d"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>xULbUjvxjGNgn5Ge8G+j9PHgpRE=</DigestValue></Reference><Reference URI="#Timestamp-2bd6edbe-6b9f-4d46-89bf-c18047dfc7d6"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>1OyRY8ER02Z7Fic2AgnPYH7KlD4=</DigestValue></Reference><Reference URI="#Id-113e1b59-ff30-4a85-b164-c0cec281cc57"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>x8bHZN8cXwmW3+0UjY7N/44UCT8=</DigestValue></Reference></SignedInfo><SignatureValue>L029Kt4F8OPlsoWf4FVlE0of+R3Ngp06zKy/gVXTxwV54y55MM8yY6MrFrUZa7V5TDBT8UfIc92mMnoVcLtqC5yca/cYMh6FJgcmbKrCm6Ae1T41JcxQRtiJxzgYuTFbeINeJzOLKSgJ5r/luRrWNgjh3j6TgSWy/BCHxv2+NU8=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-91913aad-7454-4e65-a7b6-1e181b8b056d" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-113e1b59-ff30-4a85-b164-c0cec281cc57"><wst:RequestSecurityToken xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust"><wst:TokenType>http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct</wst:TokenType><wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType><wst:Base><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-91913aad-7454-4e65-a7b6-1e181b8b056d" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></wst:Base><wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy"><wsa:EndpointReference><wsa:Address>http://riker:8888/tokenService</wsa:Address></wsa:EndpointReference></wsp:AppliesTo><wst:LifeTime><wsu:Expires>2004-08-06T01:57:20Z</wsu:Expires></wst:LifeTime></wst:RequestSecurityToken></soap:Body></soap:Envelope>